do local _ = {
helpfa = {
help = [[
📋🌸📋 `راهنمای ربات`       ✡️ AHMEDᵇᵒᵗ
➖➖➖➖➖➖➖➖➖➖➖
`بخش موردنظر شما کدام است؟؟؟`

`1`.`راهنمای قفلها`

`2`.`راهنمای پاکسازی لیستهای مدیریتی`

`3`.`راهنمای حساسیت و حالات فلود(اسپم)`

`4`.`راهنمای مدیر و عزل مدیر و مالک گروه`

`5`.`راهنمای اطلاعات شخصی و عمومی`

`6`.`راهنمای اخطارها`

`7`.`راهنمای وضعیت و حالات`   ✡️ AHMEDᵇᵒᵗ 

`8`.`راهنمای بخش سرگرمی(فان)`

`9`.`لغو عملیات`
ــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــ
✡️ توجه خیلی مهم ✡️

✨ دریافت راهنمای بخش انتخابی شما با ارسال عدد مربوط به ان بخش بعداز ارسال کلمه راهنما امکانپذیر میباشد
ــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــ
*👨‍💻سازنده ربات*                       ahmed_31324@
*👨🏼‍💻پشتیبانی و سفارش*       AhMeDaLhAsAn1324_bot@            
]]
,
helplock = [[
📋🌸📋 راهنمای قفلها

برای قفل کردن میتونید از دستور قفل 
و برای بازکردن از دستور بازکردن استفاده کنید
ــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــ
//`اسپم`//`لینک`//`فلود`//`صفحات اینترنتی`//`سرویس تلگرام`//`نوشتار فارسی`//`نوشتار انگلیسی`//`دکمه شیشه ای`//`تگ`//`هشتگ`//`ورود ربات`//`فروارد`//`ویرایش پیام`//`مدل نشانه گذاری`//`پست`//`پست تکراری`//`بازی`//`سنجاق پیام`//`ورود عضو`//`موقعیت مکانی`//`متن`//`عکس`//`فیلم سلفی`//`استیکر`//`فایل`//`موزیک`//`فیلم`//`گیف`//`ویس`//`گروه`
ـــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــ
✡️ : شما میتوانید در هر زمان با دستور `فهرست` از
منوی شیشه ای برای سهولت نیز استفاده کنید
ــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــ
*👨‍💻سازنده ربات*                           ahmed_31324@
*👨🏼‍💻پشتیبانی و سفارش*         AhMeDaLhAsAn1324_bot@
]]
,
helpmedia = [[
]]
,
helpsetlink = [[
]]
,
helpprodemo = [[
📋🌸📋 راهنمای مدیر و عزل مدیر و مالک گروه
ــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــ
1️⃣ : برای `مدیر`کردن یک کاربر اول باید مقام `مالک`
گروه رو داشته باشید سپس کافیه بروی پیامی 
از شخص موردنظر رو ریپلی کنید و دستور`مدیر`
رو اعمال کنید/
ــــــــــــــــــــ
2️⃣ : راه دیگری نیز وجود دارد و ان نوشتن دستور `مدیر`
بهمراه ایدی عددی فرد میباشد/
ــــــــــــــــــــ
✡️ : سودوهای محترم دقت داشته باشن
از همین روشها با این تفاوت که بجای `مدیر`
ازدستور `مالک` میتونن برای مقام دادن به `مالک` گروه
میتونن استفاده کنن/
ــــــــــــــــــــ
✨ : برای عزل هریک از مقامهای داده شده کافیه در ابتدای
دستورات بالا `حذف` رو اضافه کنید/
ــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــ
*👨‍💻سازنده ربات*                       ahmed_31324@
*👨🏼‍💻پشتیبانی و سفارش*       AhMeDaLhAsAn1324_bot@            
]]
,
helpjanebi = [[
📋🌸📋 راهنمای اطلاعات شخصی و عمومی
ــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــ
📋🌸📋 `اطلاعات من`
▫️ دریافت شناسه عددی و مقام شما
ــــــــــــــــــــ
📋🌸📋 `ایدی`
▫️ دریافت شناسه و نام شما (به دو صورت)
1. بصورت ساده و بدون عکس
2 . با عکس
ـــــــــــــــــــــ
📋🌸📋 `عکس پروفایلم` [ 1 - 10 ]
▫️ دریافت عکسهای پروفایلتان 
ــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــ
*👨‍💻سازنده ربات*                           ahmed_31324@
*👨🏼‍💻پشتیبانی و سفارش*         AhMeDaLhAsAn1324_bot@
]]
,
helpspamflood = [[
📋🌸📋 راهنمای حساسیت و حالات فلود(`اسپم`)
ــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــ
📋🌸📋 `قفل اسپم`
▫️ حذف پیامهای طولانی از پیش تنظیم شده
📋🌸📋 تنظیم اسپم `[ 40 - به بالا ]`
▫️ تعیین حد مجاز بعنوان پیام طولانی
ــــــــــــــــــــ
📋🌸📋 `قفل فلود`
▫️ حذف پیامهای مکرره از پیش تنظیم شده
✡️ توجه داشته باشید که به دو روش میتونید با
این نوع پیامها برخورد کنید
ــــــــــــــــــــ
📋🌸📋 `وضعیت فلود حذف پیام`
با ارسال پیام مکرر فقط پیام فرد خاطی حذف میشود

📋🌸📋 `وضعیت فلود اخراج`
با ارسال پیام مکرر هم پیامها حذف خواهد شد و هم فرد خاطی
ــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــ
*👨‍💻سازنده ربات*                           ahmed_31324@
*👨🏼‍💻پشتیبانی و سفارش*       AhMeDaLhAsAn1324_bot@            
]]
,
helpvaziat = [[
📋🌸📋 راهنمای وضعیت و حالات   ✡️ AHMEDᵇᵒᵗ
➖➖➖➖➖➖➖➖➖➖➖
📋🌸📋 `قفل حالت سختگیرانه`
◻️ در این حالت اگر فردی لینک ارسال کند
علاوه بر لینک خود فرد خاطی نیز ریموو خواهد شد
📋🌸📋 شما در هر زمان میتونید با دستور `بازکردن قفل حالت سختگیرانه`
انرا غیرفعال کنید
ــــــــــــــــــــــــــــــــــــــــ
📋🌸📋 `قفل جی تایم 1`
◾️ در این حالت گروه بصورت زمان دار یک ساعت
قفل خواهد شد(عدد انتخابی ب دلخواه شماست)
ــــــــــــــــــــــــــــــــــــــــ
📋🌸📋 `قفل حالت عدم جواب`
◾️بعضی از دستورات همگانی هستند،اگر این حالت فعال باشد ربات به آنها نیزپاسخ نخواهد داد
▪️شما میتونید در هر زمان با جایگزین کردن `بازکردن` بجای `قفل`
انرا غیرفعال کنید
ــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــ
*👨‍💻سازنده ربات*                          ahmed_31324@
*👨🏼‍💻پشتیبانی و سفارش*       AhMeDaLhAsAn1324_bot@
]]
,
helppanel = [[
📋🌸📋 راهنمای تنظیمات بیشتر
➖➖➖➖➖➖➖➖➖➖➖
📋🌸📋 `وضعیت نمایش شماره تلفن فعال`
◻️ فعال کردن نمایش شماره تلفن
📋🌸📋 برای `غیرفعال` کردن این دستور از `غیرفعال` بجای `فعال`
میتونید استفاده کنید
ــــــــــــــــــــــــــــــــــــــــ
📋🌸📋 `تنظیم زبان انگلیسی`
◻️ تغییر زبان ✡️ AHMEDᵇᵒᵗ به انگلیسی
📋🌸📋 برای تغییر دادن زبان هم،فقط کافیه زبان مورد نظرتونو
عوض کنید
ــــــــــــــــــــــــــــــــــــــــ
📋🌸📋 `نمایش ادیت فعال`
◻️ پیامهای ویرایش شده را نمایش میدهد
که با `غیرفعال`کردن این دستور دیگر پیامهای ویرایش شده
نمایش داده نخواهد شد
ــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــ
*👨‍💻سازنده ربات*                  ahmed_31324@
*👨🏼‍💻پشتیبانی و سفارش*      AhMeDaLhAsAn1324_bot@
]]
,
helpclean = [[
📋🌸📋 راهنمای پاکسازی لیستهای مدیریتی و پیامها
➖➖➖➖➖➖➖➖➖➖➖
📋🌸📋 `پاک کردن دلیتی ها`
◻️ حذف لیست افراد دلیت اکانت زده
ــــــــــــــــــــــــــــــــــــــــ
📋🌸📋`پاک کردن فیلترلیست`
◻️ حذف کلمات ممنوع شده در گروه
ــــــــــــــــــــــــــــــــــــــــ
📋🌸📋`پاک کردن مدیران`
◻️ حذف لیست مدیران گروه
ــــــــــــــــــــــــــــــــــــــــ
📋🌸📋`پاک کردن لیست بن`
◻️حذف لیست کاربران مسدود شده از گروه
ــــــــــــــــــــــــــــــــــــــــ
📋🌸📋`پاک کردن محدودین`
◻️ حذف لیست کاربران محدود شده در گروه
ــــــــــــــــــــــــــــــــــــــــ
📋🌸📋`پاک کردن بنگلوبال`
◻️ حذف لیست کاربران مسدود شده از گروههای ✡️ AHMEDᵇᵒᵗ
ــــــــــــــــــــــــــــــــــــــــ
📋🌸📋`پاک کردن پیام ها`
◻️ حذف همه پیامهای گروه
ــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــ
*👨‍💻سازنده ربات*                           ahmed_31324@
*👨🏼‍💻پشتیبانی و سفارش*         AhMeDaLhAsAn1324_bot@
]]
,
helpwarn = [[
📋🌸📋 راهنمای اخطارها
➖➖➖➖➖➖➖➖➖➖➖
📋🌸📋 `Warn @Username`
◻️ اخطار دادن به کاربرشما
✡️ شما میتوانید از [ ریپلای ، شناسه ] نیز برای اخطار دادن
بهره ببرید
ــــــــــــــــــــــــــــــــــــــــ
📋🌸📋 `Unwarn @Username`
◻️ حذف اخطارهای یک کاربر
✡️ شما میتوانید از [ ریپلای ، شناسه ] نیز برای اخطار دادن
بهره ببرید
ــــــــــــــــــــــــــــــــــــــــ
📋🌸📋 `Setwarn` [ 1 - Up ]
◻️ تنظیم حداکثر اخطار مجاز برای کاربران
ــــــــــــــــــــــــــــــــــــــــ
📋🌸📋`وضعیت اخطار محدودیت`
◻️ محدود کردن کاربر درصورت تجاوز از
حداکثر اخطار تعیین شده
ــــــــــــــــــــــــــــــــــــــــ
📋🌸📋`وضعیت اخطار اخراج`
◻️ `اخراج` کاربر درصورت تجاوز از
حداکثر اخطار تعیین شده
ــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــ
*👨‍💻سازنده ربات*               ahmed_31324@
*👨🏼‍💻پشتیبانی و سفارش*      AhMeDaLhAsAn1324_bot@
]]
,
helpfun = [[
📋🌸📋 راهنمای بخش سرگرمی(فان)
➖➖➖➖➖➖➖➖➖➖➖
📋🌸📋 `اوقات شرعي` ( `اسم شهر` )
◻️ با استفاده از اين دستور شما مي‌توانيد اوقات شرعي شهر وارد شده را دريافت كنید
ــــــــــــــــــــــــــــــــــــــــ
📋🌸📋 ‌`زمان`
◻️ با استفاده از اين دستور شما مي‌توانيد از زمان و تاريخ جاري مطلع شوید
ــــــــــــــــــــــــــــــــــــــــ
📋🌸📋 `به عکس`
◻ ️با استفاده از اين دستور شما مي‌توانيد استیکر خود را به عکس تبدیل کنید.
ــــــــــــــــــــــــــــــــــــــــ
📋🌸📋 `به استیکر` ( `ریپلای` )
◻️ با استفاده از اين دستور شما مي‌توانيد تصویر خود را به استیکر تبدیل کنید
ــــــــــــــــــــــــــــــــــــــــ
📋🌸📋گیف ( `متن` ) 
◻️با استفاده از اين دستور شما مي‌توانيد متن خود را به یک فایل تصویری متحرک یا همان Gif تبدیل کنید
ــــــــــــــــــــــــــــــــــــــــ
📋🌸📋 Love اسم اول ، اسم دوم
◻️با استفاده از این دستور شما میتوانید یک استیکر حاوی دو اسم و یک قلب ایجاد کنید ! این دستور از زبان فارسی پشتیبانی نمی‌کند و شما باید اسم ها را به زبان انگلیسی وارد کنید

✡️ به مثال دقت شود
Love sara amir
ــــــــــــــــــــــــــــــــــــــــ
📋🌸📋 `Keepcalm` اسم ، رنگ زمینه ، رنگ نوشته ، رنگ تاج ، اندازه
◻️با استفاده از این دستور شما میتوانید یک استیکر `KeepCalm` با متن دلخواه ایجاد کنید ! این دستور نیز  همانند استیکر `Love` از زبان فارسی پشتیبانی نمی‌کند و شما باید آن را به صورت انگلیسی وارد کنید

✡️ به مثال دقت شود
`keepcalm Robot white black black 600`
ـــــــــــــــــــــــــــــــــــــــ
📋🌸📋 `من`
◻️ با استفاده از این دستور شما میتوانید اطلاعات اکانت خود ( `نام اکانت ، یوزر نیم و آیدی عددی` ) رو دریافت کنید
ــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــ
*👨‍💻سازنده ربات*                     ahmed_31324@
*👨🏼‍💻پشتیبانی و سفارش*       AhMeDaLhAsAn1324_bot@
]]
}
,
helpen = {
help = [[
»* List of bot Guide *:

•• Please choose a * Section * to display!

`1-` Enable or disable the status of the Robot
`2-` Lock the main section to enable or disable
`3-` Lock or unlock the media lock
`4-` Switch and lock sensitivity Flood and spam
`5-` Promotion and dismissal of the user
`6-` Part of the set and get link Group
`7-` Ancillary facilities robot
`8-` Set Settings of Group Panel
`9-` How to Clean lists
`10-` Section Warnings
`11-` Fun Capability & Public Commands Guide
`0-` Cancel operation

> To get to the * FAQ * section, simply send its * Number *!
]]
,
helplock = [[
* The main lock Guide *:

You can active bot locks withe `lock` Pattern and You can inactive bot locks withe` Unlock` Pattern!

* Lock Example *:
`Lock links`

* Unlock Example *:
`Unlock links`

> All * Values * of Bot:

- `Spam`
- `links`
- `Webpage`
- `Flood`
- `Tgservice`
- `English`
- `Farsi`
- `Inline`
- `Pin`
- `Mention`
- `Markdown`
- `Edit`
- `Bots`
- `Fwd`
- `Hashtag`
- `Post`
- `Duplipost`
- `Game`
- `Inline`
- `Member`
]]
,
helpmedia = [[
•• * The main Media Guide *:

You can active Media lock withe `lock` Pattern and You can inactive Media lock withe` Unlock` Pattern!

* Lock Example *:
`Lock File`

* Unlock Example *:
`Unlock File`

> All * Media * of Bot:

- `Gif`
- `Photo`
- `Video`
- `Selfvideo`
- `Text`
- `Voice`
- `Music`
- `location`
- `File`
- `Contact`
- `Sticker`
]]
,
helpsetlink = [[
•• *Instruction Set and get links Group* :

Enter the command `Setlink`  !

Then link the group to be *Recorded* within the group itSelf  !

Once registered with the command `Link` can get it whenever you want !
]]
,
helpprodemo = [[
•• * A Manager's Guide to Promotion or dismissal as a user *:

>> There are Four ways for *Promotion*!

> The first Method:

One of the messages to the user and command Ryplay *Promote submit*!

> The second method:

Promote Write command and the command to write the same numeric ID!
* Example *:
`Promote 201321014`

> The third method:

Promote ordered to write and record the user's username in front of it!
* Example *:
`Promote @Username`

Dismissal of the above steps is enough for one person only with the difference that instead ordered to replace Promote Demote command
* Example *:
`Demote @Username`

> The four method:

* Example *

`Promote 'Metion'`
]]
,
helpjanebi = [[
•• *Lateral guide features* :

Id command you can use to *get your profile* !

If you want your details along with your profile photo robot sends orders to send `Getidstatus photo` ! To return to the simple mode command to send `Getidstatus simple` !

Ordered `me` to get the numeric ID is your place!

To get a numeric identifier, you can use two methods

> The first method :

Ryplay person a message and send commands `Id`

> The second Method :

Id command and the *Username* of the Person writing it up
*Example* :
`id @Username`

To get to see your profile, you can use the following command

`getpro [1 - 10]`

*Example* :
`getpro 2`

To pin down a message via robot can send messages to the `Pin` Ryplay then ordered !
To remove the message from the pin `Unpin` can use the command !
To re-pin the former message, you can use the command `Repin` !
]]
,
helpspamflood = [[
•• *Guide lock flood and spam* :

Lock will prevent spammers from sending messages loud and long!
Its sensitivity is adjustable and unit characters is!
It is set in the following order:

`Setspam [40 - Up]`

For example, you want to delete messages longer than 80 characters should be used from the command Setspam 80!

Flood lock prevents the burst, sending multiple messages!
Sensitivity is adjustable and it shows!

It is the second mode!

> First :

If he burst start *Sending messages*, all messages will be removed and 5 seconds he can send a message!

Active command of the Situation :

`Setstatus del`

> The second mode :

If he burst start *Sending messages* , all messages will be deleted from the group Remove he will !

`Setstatus kick`

Its *Sensitivity* is adjustable to a duplicate message!

`Setflood [1 - Up]`
]]
,
helpvaziat = [[
•• *Guide robot status* :

> *Strict mode*

A condition that, if enabled, someone from the group remove send the link!

*Activation* :
`Lock strict`

*Deactivate* :
`Unlock strict`

> *Overall lock Group*

A condition that prevents a normal user from sending any messages!

*Activation* :
`Lock all`

*Deactivate* :
`Unlock all`

To enable the timer can act as follows:

*Activation for an Hour* :
`lock gtime 1`

*Activation for two Hours* :
`lock gtime 2 0 0`

And ...

> *NoN-answer*

Some of universal grammar, that is normal users are answered, they will not respond if this mode is enabled!

*Activation* :
`Lock cmd`

*Deactivate* :
`Unlock cmd`
]]
,
helppanel = [[
•• *Guide Group Panel* :

> *Enable AddPhone*

Pattern :
`addphone on`

> *Disable AddPhone*

Pattern :
`addphone off`

> *Set Group En language*

Pattern :
`setlang en`

> *Set Group Fa language*

Pattern :
`setlang fa`

> *Reset Group Status*

Pattern :
`reset`

> *Show Edited Msgs*

Pattern :
`showedit on`

> *UnShow Edited Msgs*

Pattern :
`showedit off`
]]
,
helpclean = [[
•• * Guide for Cleans *:

> * Clean Delted Accounts *

Pattern:
`Clean deleted`

> * Clean Filter Words *

Pattern:
`Clean filterlist`

> * Clean Modrators list *

Pattern:
`Clean modlist`

> * Clean BanUsers *

Pattern:
`Clean banlist`

> * Clean MutedUsers *

Pattern:
`Clean mutelist`

> * Clean Blacklist *

Pattern:
`Clean blocked`

> * Clean All Pms *

Pattern:
`Clean msgs`

> * Clean All Members *

Pattern:
`Clean members`
]]
,
helpwarn = [[
•• * Guide Group warns *:


> * Send Warn *

you can send warn to users withe sub Pattern and you can send it withe reply

* Pattern *:
`Warn @Username`


> * Get unWarn *

you can send unwarn to users withe sub Pattern and you can send it withe reply

* Pattern *:
`Unwarn @Username`


> * Set Group warns *

* Pattern *:
`Setwarn [Value]`


> * Punishments of Warnings *:

- Mute user befor Warnings
* Pattern *:
`Warnstatus mute`

- Remove user befor Warnings
* Pattern *:
`Warnstatus remove`
]]
,
helpfun = [[
•• * Fun Capability & Public Commands Guide *:

> * Religious times *

•• * With this command, you can get the legal entry of the entered city *.

* Pattern *:
`Praytime` ( `CityName` )

> * Date And Time *

 •• * With this command you may know the time and date *

* Pattern *:
`Time`

> * Convert Photo To Sticker *

•• * With this command, you can turn your images to stickers *

* Pattern *:
`To Sticker` ( `On Reply` )

> * Convert Sticker To Photo *

•• * With this command, you can turn your sticker to images *

* Pattern *:
`To Photo` ( `On Reply` )

> * Convert Text To Gif *

•• * With this command, you can turn your text to the gif *

* Pattern *:
`Gif` ( `Text` )

> * KeepCalm Sticker *

••  * With this command, you can make keepcalm stickers with Custom text . This command doesn't support in the persian language just as Love Sticker and you must type it English *

* English Command * :
`Keepcalm Name , BackGround Color , Text Color , Crown Color , Size`

* Pattern *:
`keepcalm Robot white black black 600`

> * Love Sticker *

•• * With this command, you can make a sticker contains two names and one heart. This command doesnt support persian language the names in English *

* English Command * :
`Love First Name , Second Name`

* Pattern *:
`Love Eset Robot`

> * My Id Command *

•• * With this command, you can get your Numeric Telegram ID. Answering to this command for the normall users depends on disabeling Non-response mode *

* Pattern *:
`id`

> * My Rank Command *

•• * With this command, you can get your Account Informations ( Numeric Telegram ID , UserName , Account FirstName ) And Your Rank In Robot ; Answering to this command for the normall users depends on disabeling Non-response mode *

* Pattern *:
`Me`
]]
}
}
return _
end
